{"config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa4/home/yipstar/sdc/projects/simulator/nvidia_model.py\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_1", "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "trainable": true, "output_shape": null}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activation": "linear", "b_constraint": null, "nb_filter": 24, "nb_row": 31, "activity_regularizer": null, "subsample": [5, 5], "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 98, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "b_constraint": null, "nb_filter": 36, "nb_row": 14, "activity_regularizer": null, "subsample": [5, 5], "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 47, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "b_constraint": null, "nb_filter": 48, "nb_row": 5, "activity_regularizer": null, "subsample": [3, 3], "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 22, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "b_constraint": null, "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "subsample": [3, 3], "trainable": true, "name": "convolution2d_4", "init": "glorot_uniform", "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 20, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "b_constraint": null, "nb_filter": 64, "nb_row": 1, "activity_regularizer": null, "subsample": [3, 3], "trainable": true, "name": "convolution2d_5", "init": "glorot_uniform", "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 18, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "output_dim": 1164, "b_constraint": null, "activity_regularizer": null, "input_dim": 64, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "input_dim": 1164, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "input_dim": 100, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "input_dim": 50, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "input_dim": 10, "name": "dense_5", "init": "glorot_uniform", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}