{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa5/home/yipstar/sdc/projects/simulator/nvidia_model2.py\u00da\b<lambda>\u0018\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "function_type": "lambda", "trainable": true, "input_dtype": "float32", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "nb_filter": 24, "bias": true, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "nb_filter": 36, "bias": true, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "nb_filter": 48, "bias": true, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "nb_filter": 64, "bias": true, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "init": "glorot_uniform", "activation": "linear", "subsample": [1, 1], "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "bias": true, "input_dim": 640, "W_constraint": null, "trainable": true, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"output_dim": 50, "bias": true, "input_dim": 100, "W_constraint": null, "trainable": true, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 10, "bias": true, "input_dim": 50, "W_constraint": null, "trainable": true, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"output_dim": 1, "bias": true, "input_dim": 10, "W_constraint": null, "trainable": true, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}]}