{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa4/home/yipstar/sdc/projects/simulator/nvidia_model.py\u00da\b<lambda>\f\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "subsample": [5, 5], "name": "convolution2d_1", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 31, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_col": 98, "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "subsample": [5, 5], "name": "convolution2d_2", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 14, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_col": 47, "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "subsample": [3, 3], "name": "convolution2d_3", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_col": 22, "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "subsample": [3, 3], "name": "convolution2d_4", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_col": 20, "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "subsample": [3, 3], "name": "convolution2d_5", "bias": true, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 1, "dim_ordering": "tf", "trainable": true, "activation": "linear", "nb_col": 18, "activity_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 64], "activation": "linear", "W_regularizer": null, "input_dim": 64, "trainable": true, "output_dim": 1164, "input_dtype": "float32", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 1164], "activation": "linear", "W_regularizer": null, "input_dim": 1164, "trainable": true, "output_dim": 100, "input_dtype": "float32", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 100], "activation": "linear", "W_regularizer": null, "input_dim": 100, "trainable": true, "output_dim": 50, "input_dtype": "float32", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 50], "activation": "linear", "W_regularizer": null, "input_dim": 50, "trainable": true, "output_dim": 10, "input_dtype": "float32", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 10], "activation": "linear", "W_regularizer": null, "input_dim": 10, "trainable": true, "output_dim": 1, "input_dtype": "float32", "b_constraint": null, "W_constraint": null}}], "keras_version": "1.2.0"}