{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1", "trainable": true, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa4/home/yipstar/sdc/projects/simulator/nvidia_model.py\u00da\b<lambda>\r\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_row": 31, "b_constraint": null, "border_mode": "same", "nb_col": 98, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 24, "subsample": [5, 5], "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_row": 14, "b_constraint": null, "border_mode": "same", "nb_col": 47, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_filter": 36, "subsample": [5, 5], "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "nb_col": 22, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_filter": 48, "subsample": [3, 3], "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "b_constraint": null, "border_mode": "same", "nb_col": 20, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_filter": 64, "subsample": [3, 3], "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "dim_ordering": "tf", "nb_row": 1, "b_constraint": null, "border_mode": "same", "nb_col": 18, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "nb_filter": 64, "subsample": [3, 3], "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 1164, "name": "dense_1", "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": 64, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 100, "name": "dense_2", "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": 1164, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 50, "name": "dense_3", "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 10, "name": "dense_4", "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_5", "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": 10, "trainable": true, "W_regularizer": null, "activation": "linear"}}], "keras_version": "1.2.1"}